[
  {
    "title": "حفر الآبار",
    "image": "https://halabtodaytv.net/wp-content/uploads/2022/10/Hasakeh.jpg",
    "shortDescription": "توفير مياه نظيفة للمجتمعات المحتاجة",
    "impact": "صدقة جارية تنفع الناس والحيوانات لسنوات طويلة",
    "fullDescription": "حفر الآبار من أعظم الصدقات الجارية التي يمكن أن يقدمها المسلم، حيث توفر المياه النظيفة للمجتمعات المحتاجة في المناطق التي تعاني من شح المياه. يمكن أن يستفيد من البئر الواحد مئات أو آلاف الأشخاص لعشرات السنين.",
    "detailedImpact": "قال رسول الله ﷺ: 'أفضل الصدقة سقي الماء'. وقال أيضاً: 'من حفر بئراً فشرب منه كبد حرى من إنسان أو حيوان كان له أجر إلى يوم القيامة'. توفير المياه النظيفة يساهم في تحسين الصحة العامة، وتقليل الأمراض، وتمكين المجتمعات من الزراعة وتربية المواشي، مما يساهم في تحسين الأمن الغذائي والاقتصادي.",
    "howToContribute": "يمكنك المساهمة في حفر بئر كامل أو المشاركة بجزء من تكلفة البئر من خلال المؤسسات الخيرية الموثوقة. تتراوح تكلفة حفر البئر حسب العمق والموقع والتقنية المستخدمة."
  },
  {
    "title": "بناء المساجد",
    "image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fdkhlak.com%2Fwp-content%2Fuploads%2F2020%2F01%2F63168-7.jpg&f=1&nofb=1&ipt=bee546c7c73959c4260ee38ffd1fa53ffd2189edf0cb42b1909e5596410e7e27&ipo=images",
    "shortDescription": "المساهمة في بناء بيوت الله في الأرض",
    "impact": "أجر مستمر مع كل صلاة وذكر وتلاوة تقام فيه",
    "fullDescription": "بناء المساجد من أعظم الأعمال التي يتقرب بها العبد إلى الله تعالى، فالمساجد هي بيوت الله في الأرض، ومنارات الهداية والعلم. المساهمة في بناء مسجد، سواء كان كاملاً أو جزءاً منه، تعد من أفضل الصدقات الجارية.",
    "detailedImpact": "قال رسول الله ﷺ: 'من بنى لله مسجداً، بنى الله له بيتاً في الجنة'. المسجد ليس مكاناً للصلاة فحسب، بل هو مركز للمجتمع المسلم، حيث تقام فيه الصلوات، وحلقات العلم، وتلاوة القرآن، والأنشطة الاجتماعية. كل عبادة تقام في المسجد يكون لباني المسجد مثل أجر من قام بها.",
    "howToContribute": "يمكنك المساهمة في بناء مسجد كامل، أو المشاركة في جزء من البناء مثل القبة أو المنارة أو المحراب. كما يمكنك المساهمة في تجهيز المسجد بالفرش والمصاحف والكتب. تختلف تكلفة بناء المسجد حسب الحجم والموقع."
  },
  {
    "title": "كفالة الأيتام",
    "image": "https://images.unsplash.com/photo-1488521787991-ed7bbaae773c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=800&q=80",
    "shortDescription": "رعاية الأطفال الذين فقدوا آباءهم",
    "impact": "بناء جيل صالح يدعو لكافله بالخير",
    "fullDescription": "كفالة اليتيم تعني تقديم الدعم المالي والمعنوي للأطفال الذين فقدوا آباءهم، لتأمين احتياجاتهم الأساسية من مأكل ومشرب وملبس وتعليم ورعاية صحية. هذا العمل الخيري له أثر كبير في حياة هؤلاء الأطفال وفي المجتمع ككل.",
    "detailedImpact": "قال رسول الله ﷺ: 'أنا وكافل اليتيم في الجنة هكذا' وأشار بالسبابة والوسطى وفرج بينهما. كفالة اليتيم تساهم في بناء شخصية سوية للطفل، وتحميه من الانحراف والتشرد، وتمكنه من أن يكون فرداً صالحاً في المجتمع. كما أن اليتيم الذي يتربى على الخير سيدعو لكافله بالخير في حياته وبعد مماته.",
    "howToContribute": "يمكنك كفالة يتيم بشكل كامل أو المساهمة بجزء من تكاليف رعايته. هناك العديد من المؤسسات الخيرية التي تتيح كفالة الأيتام بمبالغ شهرية متفاوتة حسب البلد واحتياجات اليتيم."
  },
  {
    "title": "نشر العلم",
    "image": "https://images.unsplash.com/photo-1503676260728-1c00da094a0b?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=800&q=80",
    "shortDescription": "المساهمة في نشر العلم النافع",
    "impact": "أجر مستمر مع كل من ينتفع بهذا العلم",
    "fullDescription": "نشر العلم النافع من أعظم الصدقات الجارية، سواء كان علماً شرعياً أو علماً دنيوياً نافعاً. يمكن المساهمة في نشر العلم من خلال بناء المدارس والمعاهد، أو طباعة الكتب، أو إنشاء المكتبات، أو دعم طلاب العلم، أو إنشاء المواقع التعليمية.",
    "detailedImpact": "قال رسول الله ﷺ: 'إذا مات الإنسان انقطع عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له'. نشر العلم يساهم في تنوير العقول، وهداية القلوب، وتحسين حياة الناس. كل من ينتفع بالعلم الذي ساهمت في نشره، يكون لك مثل أجره دون أن ينقص من أجره شيء.",
    "howToContribute": "يمكنك المساهمة في نشر العلم من خلال التبرع للمؤسسات التعليمية، أو كفالة طالب علم، أو المساهمة في طباعة الكتب وتوزيعها، أو إنشاء منح دراسية، أو دعم المشاريع التعليمية في المناطق الفقيرة."
  },
  {
    "title": "غرس الأشجار",
    "image": "https://images.unsplash.com/photo-1542601906990-b4d3fb778b09?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=800&q=80",
    "shortDescription": "المساهمة في زراعة الأشجار وتخضير البيئة",
    "impact": "أجر مستمر مع كل من يستفيد من ثمارها وظلها",
    "fullDescription": "غرس الأشجار من الصدقات الجارية التي حث عليها الإسلام، فهي تساهم في تحسين البيئة، وتوفير الظل والثمار للناس والحيوانات، وتنقية الهواء، ومكافحة التصحر. كما أنها تعتبر استثماراً للأجيال القادمة.",
    "detailedImpact": "قال رسول الله ﷺ: 'ما من مسلم يغرس غرساً أو يزرع زرعاً فيأكل منه طير أو إنسان أو بهيمة إلا كان له به صدقة'. الأشجار تستمر في النمو والعطاء لعشرات أو مئات السنين، وكل من يستفيد منها من إنسان أو حيوان أو طير، يكون لك أجر ذلك. كما أن الأشجار تساهم في مكافحة التغير المناخي وتحسين جودة الهواء.",
    "howToContribute": "يمكنك المساهمة في غرس الأشجار من خلال المشاركة في حملات التشجير، أو التبرع للمؤسسات البيئية، أو زراعة الأشجار في الأماكن العامة أو في أرضك الخاصة. كما يمكنك المساهمة في مشاريع إعادة التشجير في المناطق المتضررة من التصحر أو قطع الأشجار."
  },
  {
    "title": "وقف الكتب والمصاحف",
    "image": "https://images.unsplash.com/photo-1507842217343-583bb7270b66?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=800&q=80",
    "shortDescription": "وقف المصاحف والكتب النافعة",
    "impact": "أجر مستمر مع كل قراءة وانتفاع",
    "fullDescription": "وقف المصاحف والكتب النافعة من الصدقات الجارية التي تستمر فائدتها لفترات طويلة. يمكن وقف المصاحف في المساجد والمدارس، أو وقف الكتب العلمية والثقافية في المكتبات العامة، أو توزيعها على طلاب العلم والمؤسسات التعليمية.",
    "detailedImpact": "كل من يقرأ في المصحف أو الكتاب الذي وقفته، يكون لك مثل أجره دون أن ينقص من أجره شيء. وقف المصاحف يساهم في نشر كتاب الله وتيسير تلاوته وحفظه، ووقف الكتب النافعة يساهم في نشر العلم والثقافة وتنوير العقول.",
    "howToContribute": "يمكنك شراء المصاحف والكتب النافعة ووقفها في المساجد والمكتبات العامة والمدارس. كما يمكنك المساهمة في مشاريع طباعة المصاحف وتوزيعها، أو دعم المكتبات الوقفية، أو إنشاء مكتبة وقفية في منطقتك."
  },
  {
    "title": "إطعام الطعام",
    "image": "https://images.unsplash.com/photo-1541802645635-11f2286a7482?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=800&q=80",
    "shortDescription": "إطعام الفقراء والمساكين",
    "impact": "سد حاجة المحتاجين وإدخال السرور عليهم",
    "fullDescription": "إطعام الطعام من الأعمال الخيرية التي حث عليها الإسلام، وهي من أبواب البر والإحسان. يمكن إطعام الفقراء والمساكين من خلال توزيع الوجبات أو إقامة موائد الرحمن أو دعم المطابخ الخيرية.",
    "detailedImpact": "قال رسول الله ﷺ: 'أفضل الصدقة إطعام الطعام'. إطعام المحتاجين يسد جوعهم، ويحميهم من الأمراض الناتجة عن سوء التغذية، ويدخل السرور على قلوبهم، ويزيد التماسك الاجتماعي في المجتمع.",
    "howToContribute": "يمكنك المساهمة في توزيع الوجبات الجاهزة، أو دعم المطابخ الخيرية، أو إقامة موائد الرحمن في المناسبات، أو التبرع بالمواد الغذائية عبر الجمعيات الخيرية."
  },
  {
    "title": "دعم الأرامل والمطلقات",
    "image": "https://daam.org.sa/public/storage/6/64cbb0bf18736_cta_img.jpg",
    "shortDescription": "تمكين النساء المحتاجات اقتصاديًا",
    "impact": "بناء أسر مستقرة ومنتجة",
    "fullDescription": "تقديم الدعم المالي والتدريب المهني للأرامل والمطلقات لمساعدتهن على إعالة أسرهن، مثل تمويل مشاريع صغيرة أو توفير فرص عمل مناسبة.",
    "detailedImpact": "قال ﷺ: 'خير الناس أنفعهم للناس'. هذا الدعم يحافظ على كرامة الأسرة، ويقلل من ظاهرة التسول، وينشئ جيلًا واعيًا قادرًا على الإنتاج.",
    "howToContribute": "شارك في برامج تمكين المرأة، أو تبرع لتمويل مشاريع صغيرة، أو قدم استشارات مهنية عبر المنصات الخيرية."
  },
  {
    "title": "مكتبات الوسائط الرقمية",
    "image": "https://images.unsplash.com/photo-1515879218367-8466d910aaa4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=800&q=80",
    "shortDescription": "نشر العلم عبر المنصات الإلكترونية",
    "impact": "وصول المعرفة لأي مكان في العالم",
    "fullDescription": "إنشاء منصات إلكترونية وتطبيقات تقدم محاضرات ودورات وكتبًا إلكترونية مجانية في العلوم الشرعية والدنيوية، مع توفيرها ب多种 لغات.",
    "detailedImpact": "قال ﷺ: 'بلغوا عني ولو آية'. هذه المنصات تنشر العلم دون حدود جغرافية، وتجعل المعرفة في متناول الجميع خاصة في المناطق النائية.",
    "howToContribute": "ساهم في تطوير الموقع الإلكتروني، أو ترجمة المحتوى، أو تمويل الحملات الإعلانية."
  }
]